Revit 2027 API
PolyLine.GetOutline Method
Gets the outline of the polyline.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Outline GetOutline()
Public Function GetOutline As Outline
public:
Outline^ GetOutline()
member GetOutline : unit -> Outline
Return Value
Outline
See Also
Reference
PolyLine Class
Autodesk.Revit.DB Namespace